supermileage/motor-controller-stm32-firmware/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32l4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define MCO_Pin GPIO_PIN_0
#define MCO_GPIO_Port GPIOA
#define HALL_C_Pin GPIO_PIN_1
#define HALL_C_GPIO_Port GPIOA
#define HALL_A_Pin GPIO_PIN_2
#define HALL_A_GPIO_Port GPIOA
#define THROTTLE_Pin GPIO_PIN_4
#define THROTTLE_GPIO_Port GPIOA
#define HALL_B_Pin GPIO_PIN_5
#define HALL_B_GPIO_Port GPIOA
#define A_LO_Pin GPIO_PIN_7
#define A_LO_GPIO_Port GPIOA
#define B_LO_Pin GPIO_PIN_0
#define B_LO_GPIO_Port GPIOB
#define C_LO_Pin GPIO_PIN_1
#define C_LO_GPIO_Port GPIOB
#define A_HI_Pin GPIO_PIN_8
#define A_HI_GPIO_Port GPIOA
#define B_HI_Pin GPIO_PIN_9
#define B_HI_GPIO_Port GPIOA
#define C_HI_Pin GPIO_PIN_10
#define C_HI_GPIO_Port GPIOA
#define SWDIO_Pin GPIO_PIN_13
#define SWDIO_GPIO_Port GPIOA
#define SWCLK_Pin GPIO_PIN_14
#define SWCLK_GPIO_Port GPIOA

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
